Revit 2024 API
XYZ.Y Property
Gets the second coordinate.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public double Y { get; }
Visual Basic
Public ReadOnly Property Y As Double
	Get
Visual C++
public:
property double Y {
	double get ();
}
See Also
XYZ Class
Autodesk.Revit.DB Namespace